posts/steps-of-centos-configuration.org
#+BEGIN_COMMENT
.. title: Steps of CentOS Configuration
.. slug: steps-of-centos-configuration
.. date: 2018-04-28 10:51:45 UTC+08:00
.. tags: CentOS, Shell 
.. category: Programming
.. link: 
.. description: CentOS开发环境配置
.. type: text
#+END_COMMENT

* Shell环境配置
** 安装zsh
   - =sudo yum install zsh=
** 安装oh-my-zsh
   - =sh -c "$(wget https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh -O -)"=
** 配置oh-my-zsh
   #+BEGIN_SRC shell
   # Path to your oh-my-zsh installation.
   export ZSH=/home/joey/.oh-my-zsh
   ZSH_THEME="half-life"
   PROMPT=$'%{$purple%}%n%{$reset_color%} in %{$limegreen%}%~%
   {$reset_color%}$(ruby_prompt_info " with%{$fg[red]%}" v g "%
   {$reset_color%}")$vcs_info_msg_0_%{$orange%}%{$reset_color%} at %{$hotpink%}%* %
   {$orange%}λ%{$reset_color%}'
   plugins=(
   git
   )
   source $ZSH/oh-my-zsh.sh
   # 为了区分是本地环境还是云端环境，添加了环境名称
   PROMPT=$'%{$purple%}%n (local) %{$reset_color%} in %{$limegreen%}%~%{$reset_color%}$(ruby_prompt_info " with%{$fg[red]%}" v g "%{$reset_color%}")$vcs_info_msg_0_%{$orange%}%{$reset_color%} at %{$hotpink%}%* %{$orange%}λ%{$reset_color%} '
   # 切换python virtualenv
   switch-to() {
     if [ ! -n "$1" ]; then
       echo "请输入要切换的虚拟环境名称"
     else
       envPath="/home/joey/$1/bin/activate"
       if [ ! -e "$envPath" ]; then
         echo "虚拟环境[$1]不存在"
       else
         echo "切换到虚拟环境[$1]"
         source $envPath
       fi
     fi
   }

   alias swn="switch-to nikola"
   alias sww="switch-to web"
   #+END_SRC
** 安装NodeJS
   #+BEGIN_SRC shell
   curl --silent --location https://rpm.nodesource.com/setup_9.x | sudo bash -
   sudo yum -y install nodejs
   sudo yum install gcc-c++ make
   #+END_SRC
