posts/steps-of-centos-configuration/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="description" content="CentOS开发环境配置">
<meta name="viewport" content="width=device-width">
<title>Steps of CentOS Configuration | EnJoey!</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://JoeYZXd.github.io/posts/steps-of-centos-configuration/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Joey.ZhangXiaodong">
<meta property="og:site_name" content="EnJoey!">
<meta property="og:title" content="Steps of CentOS Configuration">
<meta property="og:url" content="http://JoeYZXd.github.io/posts/steps-of-centos-configuration/">
<meta property="og:description" content="CentOS开发环境配置">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-04-28T10:51:45+08:00">
<meta property="article:tag" content="CentOS">
<meta property="article:tag" content="Shell">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="http://JoeYZXd.github.io/" title="EnJoey!" rel="home">
                EnJoey!
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archives</a></li>
                <li><a href="../../categories/">Categories</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Steps of CentOS Configuration
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2018-04-28T10:51:45+08:00">2018/04/28</time>
</div>
	  <div class="post-tags">
	    <div class="tag">
	      <a href="../../categories/centos/" rel="tag">CentOS</a>
	    </div>
	    <div class="tag">
	      <a href="../../categories/shell/" rel="tag">Shell</a>
	    </div>
	  </div>
	</div>
      </div>
    </div>
    
    
    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Shell环境配置</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">安装zsh</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>
<code>sudo yum install zsh</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">安装oh-my-zsh</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>=sh -c "$(wget <a href="https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh">https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh</a> -O -)"=
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">配置oh-my-zsh</h3>
<div class="outline-text-3" id="text-1-3">
<div class="highlight"><pre><span></span># Path to your oh-my-zsh installation.
export ZSH=/home/joey/.oh-my-zsh
ZSH_THEME="half-life"
PROMPT=$'%{$purple%}%n%{$reset_color%} in %{$limegreen%}%~%
{$reset_color%}$(ruby_prompt_info " with%{$fg[red]%}" v g "%
{$reset_color%}")$vcs_info_msg_0_%{$orange%}%{$reset_color%} at %{$hotpink%}%* %
{$orange%}λ%{$reset_color%}'
plugins=(
git
)
source $ZSH/oh-my-zsh.sh
# 为了区分是本地环境还是云端环境，添加了环境名称
PROMPT=$'%{$purple%}%n (local) %{$reset_color%} in %{$limegreen%}%~%{$reset_color%}$(ruby_prompt_info " with%{$fg[red]%}" v g "%{$reset_color%}")$vcs_info_msg_0_%{$orange%}%{$reset_color%} at %{$hotpink%}%* %{$orange%}λ%{$reset_color%} '
# 切换python virtualenv
switch-to() {
  if [ ! -n "$1" ]; then
    echo "请输入要切换的虚拟环境名称"
  else
    envPath="/home/joey/$1/bin/activate"
    if [ ! -e "$envPath" ]; then
      echo "虚拟环境[$1]不存在"
    else
      echo "切换到虚拟环境[$1]"
      source $envPath
    fi
  fi
}

alias swn="switch-to nikola"
alias sww="switch-to web"
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">安装NodeJS</h3>
<div class="outline-text-3" id="text-1-4">
<div class="highlight"><pre><span></span>curl --silent --location https://rpm.nodesource.com/setup_9.x | sudo bash -
sudo yum -y install nodejs
sudo yum install gcc-c++ make
</pre></div>
</div>
</div>
</div>
        
    


        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2018         <a href="mailto:joy.zhangxiaodong@gmail.com">Joey.ZhangXiaodong</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
